Revit 2026 API

# ScheduleDefinitionGetFilter Method

---

Gets a filter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ScheduleFilter GetFilter(
	int index
)
```
```vb
Public Function GetFilter (
	index As Integer
) As ScheduleFilter
```
```cpp
public:
ScheduleFilter^ GetFilter(
	int index
)
```
```fsharp
member GetFilter :
        index : int -> ScheduleFilter
```

#### Parameters

index Int32
     The index of the filter.

#### Return Value

ScheduleFilter A copy of the filter.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | index is not a valid filter index. |

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace